Bind Link will delete its associated Parts.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BindLinkWillDeleteAllPartsWarning { get; }
  Visual Basic
Public Shared ReadOnly Property BindLinkWillDeleteAllPartsWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BindLinkWillDeleteAllPartsWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DPartFailures Class
  Autodesk.Revit.DB Namespace